<a href="https://colab.research.google.com/github/03dipak/practise-pandas-ml/blob/master/05_Merge/Auto_MPG/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [3]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv",sep=',')
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv",sep=',')
print(cars1.head())
#print(cars2.head())

    mpg  cylinders  displacement  ... Unnamed: 11  Unnamed: 12  Unnamed: 13
0  18.0          8           307  ...         NaN          NaN          NaN
1  15.0          8           350  ...         NaN          NaN          NaN
2  18.0          8           318  ...         NaN          NaN          NaN
3  16.0          8           304  ...         NaN          NaN          NaN
4  17.0          8           302  ...         NaN          NaN          NaN

[5 rows x 14 columns]

In [4]:
cars1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 14 columns):
mpg             198 non-null float64
cylinders       198 non-null int64
displacement    198 non-null int64
horsepower      198 non-null object
weight          198 non-null int64
acceleration    198 non-null float64
model           198 non-null int64
origin          198 non-null int64
car             198 non-null object
Unnamed: 9      0 non-null float64
Unnamed: 10     0 non-null float64
Unnamed: 11     0 non-null float64
Unnamed: 12     0 non-null float64
Unnamed: 13     0 non-null float64
dtypes: float64(7), int64(5), object(2)
memory usage: 21.7+ KB

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [5]:
cars1 = cars1.loc[:,'mpg':'car']
cars1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 198 entries, 0 to 197
Data columns (total 9 columns):
mpg             198 non-null float64
cylinders       198 non-null int64
displacement    198 non-null int64
horsepower      198 non-null object
weight          198 non-null int64
acceleration    198 non-null float64
model           198 non-null int64
origin          198 non-null int64
car             198 non-null object
dtypes: float64(2), int64(5), object(2)
memory usage: 14.0+ KB

In [8]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 9 columns):
mpg             200 non-null float64
cylinders       200 non-null int64
displacement    200 non-null int64
horsepower      200 non-null object
weight          200 non-null int64
acceleration    200 non-null float64
model           200 non-null int64
origin          200 non-null int64
car             200 non-null object
dtypes: float64(2), int64(5), object(2)
memory usage: 14.1+ KB

### Step 5. What is the number of observations in each dataset?

In [7]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [9]:
cars = cars1.append(cars2)
cars.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 398 entries, 0 to 199
Data columns (total 9 columns):
mpg             398 non-null float64
cylinders       398 non-null int64
displacement    398 non-null int64
horsepower      398 non-null object
weight          398 non-null int64
acceleration    398 non-null float64
model           398 non-null int64
origin          398 non-null int64
car             398 non-null object
dtypes: float64(2), int64(5), object(2)
memory usage: 31.1+ KB

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [11]:
owners = np.random.randint(15000,high=73000,size=398,dtype='l')
owners

array([63167, 45572, 19207, 26548, 67733, 41914, 61606, 15908, 67024,
       50404, 27371, 46929, 39606, 29751, 71576, 56710, 56844, 67904,
       16149, 72578, 55806, 26455, 35414, 70992, 15670, 45527, 27499,
       22704, 17993, 64371, 39556, 47724, 26157, 36383, 52990, 29752,
       65079, 51088, 72692, 24670, 65456, 42967, 58151, 47704, 26955,
       26775, 58487, 35891, 33079, 52238, 54820, 69444, 50789, 35066,
       65962, 19405, 19544, 64898, 60843, 70443, 23318, 44219, 72725,
       16722, 66573, 43074, 72837, 47155, 49092, 54228, 60399, 56300,
       33974, 52772, 51321, 31159, 41889, 39401, 23510, 60245, 48197,
       50156, 58238, 69604, 18694, 53223, 38660, 68722, 31838, 47912,
       53150, 19073, 19634, 63038, 72286, 18475, 50181, 50477, 52544,
       20009, 22417, 36454, 54471, 50893, 29289, 47833, 32249, 46001,
       62363, 22077, 64407, 47051, 51591, 38207, 25967, 65236, 36586,
       56144, 21200, 26110, 53957, 72413, 31088, 72887, 29925, 52935,
       70442, 34610, 19596, 19994, 22036, 50966, 50655, 51299, 38922,
       72500, 55024, 72615, 35351, 62190, 66319, 40298, 53984, 39630,
       31350, 34792, 48395, 61097, 50584, 55706, 68608, 45978, 39131,
       70361, 36531, 57319, 68352, 19882, 30416, 20549, 44820, 58238,
       44328, 21580, 55383, 31574, 58000, 63085, 33908, 45120, 45772,
       55568, 45838, 36667, 64407, 23337, 64018, 27817, 27453, 69281,
       44932, 53257, 48354, 57711, 47819, 15989, 17370, 69751, 32354,
       71386, 33458, 66612, 40297, 57424, 22579, 15251, 48308, 70408,
       56654, 60667, 39813, 40646, 65732, 40049, 67216, 32280, 54562,
       33831, 32691, 48643, 36462, 34947, 18880, 28550, 39115, 16029,
       67713, 69650, 19657, 24763, 26835, 19995, 15891, 30280, 61033,
       34528, 20432, 18539, 70660, 61666, 64553, 59733, 18082, 19539,
       66700, 69821, 24054, 25460, 15757, 24126, 71403, 49110, 48324,
       19564, 26339, 34781, 34912, 46421, 18303, 60949, 67072, 28473,
       52606, 39811, 55501, 59245, 46777, 29217, 55143, 51218, 47289,
       40077, 52869, 53509, 28831, 57296, 19769, 52058, 64877, 24763,
       33546, 32542, 62973, 60820, 49484, 50570, 18657, 40478, 39827,
       63218, 68936, 38944, 29295, 36405, 51148, 28926, 50896, 51827,
       69142, 17525, 72333, 26961, 70680, 15882, 38554, 24132, 32594,
       46706, 34145, 19308, 46231, 37866, 22473, 16406, 42560, 29990,
       23377, 55677, 48602, 44291, 69244, 52881, 46697, 56225, 18413,
       50710, 22722, 64378, 55251, 41446, 19770, 71105, 50331, 19149,
       70978, 39610, 24278, 36860, 44066, 56389, 57769, 48318, 33632,
       51525, 60262, 32154, 58111, 35877, 15982, 35269, 16232, 45364,
       55642, 44843, 15277, 62146, 37083, 57747, 34766, 33716, 33651,
       15280, 28218, 40212, 47768, 19929, 52712, 68135, 47347, 62859,
       42958, 59180, 36645, 33689, 39473, 65422, 27110, 42954, 20255,
       60699, 39289, 34197, 38956, 41078, 20465, 48824, 26140, 42302,
       67982, 23248, 49053, 53221, 28830, 33843, 25240, 32015, 28560,
       27458, 56565, 47228, 42130, 31130, 68858, 25964, 46498, 30357,
       62910, 58914])

### Step 8. Add the column owners to cars

In [12]:
cars['owners'] = owners
cars.head()

    mpg  cylinders  displacement  ... origin                        car  owners
0  18.0          8           307  ...      1  chevrolet chevelle malibu   63167
1  15.0          8           350  ...      1          buick skylark 320   45572
2  18.0          8           318  ...      1         plymouth satellite   19207
3  16.0          8           304  ...      1              amc rebel sst   26548
4  17.0          8           302  ...      1                ford torino   67733

[5 rows x 10 columns]